In [1]:
import pandas as pd

In [2]:
friend_list = [
    ['name' , ['John', 'Jenny', 'Nate']],
    ['age' , [20,30,40]],
    ['job' , ['student', 'developer', 'teacher']]
]

In [3]:
df = pd.DataFrame.from_items(friend_list)

c:\users\hogoo\appdata\local\conda\conda\envs\py37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [8]:
df#여기서 인덱스 1,2만 출력하려면?

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   40    teacher

In [10]:
df = df[1:3]

In [11]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   40    teacher

In [14]:
friend_list = [
    ['name' , ['John', 'Jenny', 'Nate']],
    ['age' , [20,30,40]],
    ['job' , ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_items(friend_list)

c:\users\hogoo\appdata\local\conda\conda\envs\py37\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [18]:
df #John과 Nate만 출력하려면?

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   40    teacher

In [19]:
df.loc[[0,2]]#인덱스

   name  age      job
0  John   20  student
2  Nate   40  teacher

### by column condition

In [21]:
df[df.age > 25]#25살 이상인 정보?

    name  age        job
1  Jenny   30  developer
2   Nate   40    teacher

In [22]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   40    teacher

In [23]:
df[(df.age>25) & (df.name == 'Nate')]

   name  age      job
2  Nate   40  teacher

## Filter Column

### by index

In [25]:
friend_list = [
    ['John',20,'student'],
    ['Jenny',30,None],
    ['Nate',30,'teacher']
]

In [26]:
df = pd.DataFrame.from_records(friend_list)

In [27]:
df

       0   1        2
0   John  20  student
1  Jenny  30     None
2   Nate  30  teacher

In [28]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

## by column name

In [43]:
df = pd.read_csv('./pandas-master/pandas-master/data/friend_list_no_head.csv',
                header = None, names=['name','age','job'])

In [44]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [45]:
df_filtered = df[['name','age']]

In [46]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [47]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [48]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [49]:
df.filter(like='a', axis=1) #column name에 a가 들어간 것만.

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
df.filter(regex='b$', axis=1) #정규식